app/controllers/franchises_controller.rb

  def index
    @franchises = Franchise.all
     @meals= Meal.all
    @orders= Order.all
---
SELECT "orders".* FROM "orders"