app/controllers/parents_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @parents = Parent.all
    @orders = Order.all