app/controllers/registers_controller.rb

SELECT "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT 1  [["id", "portfolio-1-col"]]
---
    def set_register
      @register = Register.find(params[:id])