app/controllers/schools_controller.rb

SELECT "registers".* FROM "registers"
---
  def index
   @schools = School.all
    @kids= Register.all